"""Главный модуль. Запускает полный алгоритм."""
# ----------------------------------------------------------------------------------------------------------------------
import requests
# import time
import pprint
# from bs4 import BeautifulSoup as bs

from parser.pars_func_request import *
from parser.params_bank import *  # Все куки хедеры и параметры

pr = pprint.PrettyPrinter(indent=4, width=80, compact=False)

# Создаём сессию
session = requests.Session()


# ----------------------------------------------------------------------------------------------------------------------
# ----------------------------------------------------------------------------------------------------------------------
get_shops(session, CITY_DATA_ADD, imitation_ping_min = 0.5, ping_max = 1.5,
          save_name_dump='df_full_branch_data_ADD', save_name_excel='df_full_branch_data_ADD')

# ----------------------------------------------------------------------------------------------------------------------
# Раскоментировать для начала парсинга: +
# df_fin_category_data = pars_cycle(session, load_damp=True, imitation_ping_min=0.5, ping_max=2.5)
#
# print(df_fin_category_data)

# ----------------------------------------------------------------------------------------------------------------------
# ----------------------------------------------------------------------------------------------------------------------
# Сохранить в базу данных.
# Функция сохраняет датафрейм в базу данных, предварительно загрузив дамп результатов парсинга:
# load_result_pars_in_db()
# ----------------------------------------------------------------------------------------------------------------------










# ----------------------------------------------------------------------------------------------------------------------
# ----------------------------------------------------------------------------------------------------------------------
