"""Списки данных для различных запросов"""

BASE_HEADERS = {
    'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64)',
    'Accept': 'application/json',
    'Accept-Encoding': 'gzip, deflate, br, zstd',
    'Referer': 'https://www.mvideo.ru/',
    'Origin': 'https://www.mvideo.ru',
}

# https://www.mvideo.ru/bff/region/getShops  +
CITY_DATA: list[tuple] = [
    ('Бузулук', 'CityDE_31010', '4', 'S972', '4'),
    ('Новокуйбышевск', 'CityCZ_3744', '4', 'S972', '4'),
    ('Самара', 'CityCZ_1780', '4', 'S972', '4'),
    ('Бирск', 'CityDE_27142', '10', 'S906', '5'),
    ('Благовещенск', 'CityDE_27146', '10', 'S906', '5'),
    ('Стерлитамак', 'CityR_60', '10', 'S906', '5'),
    ('Уфа', 'CityCZ_2534', '10', 'S906', '5'),
    ('Вольск', 'CityDE_31342', '13', 'S908', '4'),
    ('Маркс', 'CityDE_31350', '13', 'S908', '4'),
    ('Саратов', 'CityCZ_984', '13', 'S908', '4'),
    ('Энгельс', 'CityCZ_2714', '13', 'S908', '4'),
    ('Оренбург', 'CityCZ_6276', '17', 'S930', '5'),
    ('Тольятти', 'CityCZ_6270', '24', 'S924', '4'),
    ('Белорецк', 'CityDE_27134', '27', 'S966', '5'),
    ('Ишимбай', 'CityDE_27162', '58', 'S983', '5'),
    ('Салават', 'CityR_58', '58', 'S983', '5'),
    ('Пенза', 'CityCZ_7182', '59', 'S922', '3'),
    ('Сызрань', 'CityR_109', '75', 'S941', '4'),
    ('Белебей', 'CityDE_27122', '88', 'S984', '5'),
    ('Октябрьский', 'CityCZ_15514', '88', 'S984', '5'),
    ('Туймазы', '24300007', '88', 'S984', '5'),
    ('Новотроицк', 'CityR_70', '99', 'S938', '5'),
    ('Орск', 'CityCZ_15549', '99', 'S938', '5'),
    ('Сыктывкар', 'CityR_102', '102', 'S964', '3'),
    ('Балаково', 'CityR_91', '13', 'S908', '4'),
    ('Сибай', 'CityDE_27110', '27', 'S966', '5'),
    ('Магнитогорск', 'CityR_27', '27', 'S966', '5'),
    ('Чапаевск', 'CityCZ_3798', '4', 'S972', '4'),
]


